Name: 5-conv-128-nodes-3-dense1570636690
Model 1 :
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 26, 26, 32)        320       
_________________________________________________________________
batch_normalization (BatchNo (None, 26, 26, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 32)        9248      
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 12, 12, 32)        25632     
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 12, 32)        128       
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 10, 10, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 10, 10, 64)        256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 64)          102464    
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 64)          256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 1, 1, 128)         131200    
_________________________________________________________________
batch_normalization_6 (Batch (None, 1, 1, 128)         512       
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 47)                6063      
=================================================================
Total params: 332,015
Trainable params: 331,183
Non-trainable params: 832
_________________________________________________________________
Name: 5-conv-128-nodes-3-dense1570636690
Model 2 :
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 26, 26, 32)        320       
_________________________________________________________________
batch_normalization_7 (Batch (None, 26, 26, 32)        128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 24, 24, 32)        9248      
_________________________________________________________________
batch_normalization_8 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 12, 12, 32)        25632     
_________________________________________________________________
batch_normalization_9 (Batch (None, 12, 12, 32)        128       
_________________________________________________________________
dropout_3 (Dropout)          (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 10, 10, 64)        18496     
_________________________________________________________________
batch_normalization_10 (Batc (None, 10, 10, 64)        256       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 4, 4, 64)          102464    
_________________________________________________________________
batch_normalization_12 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 1, 1, 128)         131200    
_________________________________________________________________
batch_normalization_13 (Batc (None, 1, 1, 128)         512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 47)                6063      
=================================================================
Total params: 332,015
Trainable params: 331,183
Non-trainable params: 832
_________________________________________________________________
2019-10-09 21:28:12.203137: I tensorflow/core/platform/cpu_feature_guard.cc:142] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
2019-10-09 21:28:12.222192: I tensorflow/core/platform/profile_utils/cpu_utils.cc:94] CPU Frequency: 2601325000 Hz
2019-10-09 21:28:12.222470: I tensorflow/compiler/xla/service/service.cc:168] XLA service 0x5568de4e1570 executing computations on platform Host. Devices:
2019-10-09 21:28:12.222493: I tensorflow/compiler/xla/service/service.cc:175]   StreamExecutor device (0): Host, Default Version
Epoch 1/30
W1009 21:28:13.077780 139669982209664 deprecation.py:323] From /usr/lib/python3.7/site-packages/tensorflow_core/python/ops/math_grad.py:1423: where (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where
W1009 21:28:13.989280 139669982209664 deprecation.py:323] From /usr/lib/python3.7/site-packages/tensorflow_core/python/keras/optimizer_v2/optimizer_v2.py:468: BaseResourceVariable.constraint (from tensorflow.python.ops.resource_variable_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Apply a constraint manually following the optimizer update step.
2019-10-09 21:28:14.875319: I tensorflow/core/profiler/lib/profiler_session.cc:184] Profiler session started.
1233/1233 [==============================] - 207s 168ms/step - loss: 2.0291 - acc: 0.4765 - sparse_categorical_accuracy: 0.4765 - mean_squared_error: 704.7585 - mean_absolute_error: 22.8324 - val_loss: 0.4798 - val_acc: 0.8332 - val_sparse_categorical_accuracy: 0.8332 - val_mean_squared_error: 711.0059 - val_mean_absolute_error: 22.9412
Epoch 2/30
1233/1233 [==============================] - 219s 178ms/step - loss: 0.7159 - acc: 0.7647 - sparse_categorical_accuracy: 0.7647 - mean_squared_error: 713.0941 - mean_absolute_error: 23.0079 - val_loss: 0.4049 - val_acc: 0.8595 - val_sparse_categorical_accuracy: 0.8595 - val_mean_squared_error: 711.1614 - val_mean_absolute_error: 22.9448
Epoch 3/30
1233/1233 [==============================] - 207s 168ms/step - loss: 0.5942 - acc: 0.8003 - sparse_categorical_accuracy: 0.8003 - mean_squared_error: 713.3015 - mean_absolute_error: 23.0117 - val_loss: 0.3640 - val_acc: 0.8697 - val_sparse_categorical_accuracy: 0.8697 - val_mean_squared_error: 711.2116 - val_mean_absolute_error: 22.9458
Epoch 4/30
1233/1233 [==============================] - 210s 170ms/step - loss: 0.5401 - acc: 0.8175 - sparse_categorical_accuracy: 0.8175 - mean_squared_error: 713.0004 - mean_absolute_error: 23.0063 - val_loss: 0.3480 - val_acc: 0.8745 - val_sparse_categorical_accuracy: 0.8745 - val_mean_squared_error: 711.3116 - val_mean_absolute_error: 22.9483
Epoch 5/30
1233/1233 [==============================] - 288s 233ms/step - loss: 0.5085 - acc: 0.8247 - sparse_categorical_accuracy: 0.8247 - mean_squared_error: 713.3292 - mean_absolute_error: 23.0132 - val_loss: 0.3374 - val_acc: 0.8765 - val_sparse_categorical_accuracy: 0.8765 - val_mean_squared_error: 711.2733 - val_mean_absolute_error: 22.9473
Epoch 6/30
1233/1233 [==============================] - 275s 223ms/step - loss: 0.4792 - acc: 0.8342 - sparse_categorical_accuracy: 0.8342 - mean_squared_error: 713.7340 - mean_absolute_error: 23.0216 - val_loss: 0.3488 - val_acc: 0.8717 - val_sparse_categorical_accuracy: 0.8717 - val_mean_squared_error: 711.3301 - val_mean_absolute_error: 22.9484
Epoch 7/30
1233/1233 [==============================] - 216s 175ms/step - loss: 0.4612 - acc: 0.8386 - sparse_categorical_accuracy: 0.8386 - mean_squared_error: 712.7355 - mean_absolute_error: 22.9993 - val_loss: 0.3255 - val_acc: 0.8848 - val_sparse_categorical_accuracy: 0.8848 - val_mean_squared_error: 711.3510 - val_mean_absolute_error: 22.9493
Epoch 8/30
1233/1233 [==============================] - 237s 192ms/step - loss: 0.4468 - acc: 0.8450 - sparse_categorical_accuracy: 0.8450 - mean_squared_error: 713.4424 - mean_absolute_error: 23.0165 - val_loss: 0.3265 - val_acc: 0.8822 - val_sparse_categorical_accuracy: 0.8822 - val_mean_squared_error: 711.4001 - val_mean_absolute_error: 22.9500
Epoch 9/30
1233/1233 [==============================] - 237s 192ms/step - loss: 0.4363 - acc: 0.8468 - sparse_categorical_accuracy: 0.8468 - mean_squared_error: 713.6818 - mean_absolute_error: 23.0203 - val_loss: 0.3256 - val_acc: 0.8789 - val_sparse_categorical_accuracy: 0.8789 - val_mean_squared_error: 711.4138 - val_mean_absolute_error: 22.9502
Epoch 10/30
1233/1233 [==============================] - 233s 189ms/step - loss: 0.4256 - acc: 0.8508 - sparse_categorical_accuracy: 0.8508 - mean_squared_error: 712.9711 - mean_absolute_error: 23.0076 - val_loss: 0.3174 - val_acc: 0.8809 - val_sparse_categorical_accuracy: 0.8809 - val_mean_squared_error: 711.4075 - val_mean_absolute_error: 22.9502
Epoch 11/30
1233/1233 [==============================] - 204s 165ms/step - loss: 0.4180 - acc: 0.8544 - sparse_categorical_accuracy: 0.8544 - mean_squared_error: 713.4397 - mean_absolute_error: 23.0143 - val_loss: 0.3088 - val_acc: 0.8889 - val_sparse_categorical_accuracy: 0.8889 - val_mean_squared_error: 711.4179 - val_mean_absolute_error: 22.9506
Epoch 12/30
1233/1233 [==============================] - 231s 188ms/step - loss: 0.4105 - acc: 0.8548 - sparse_categorical_accuracy: 0.8548 - mean_squared_error: 713.5776 - mean_absolute_error: 23.0181 - val_loss: 0.3035 - val_acc: 0.8896 - val_sparse_categorical_accuracy: 0.8896 - val_mean_squared_error: 711.4401 - val_mean_absolute_error: 22.9512
Epoch 13/30
1233/1233 [==============================] - 279s 226ms/step - loss: 0.4028 - acc: 0.8579 - sparse_categorical_accuracy: 0.8579 - mean_squared_error: 712.9812 - mean_absolute_error: 23.0036 - val_loss: 0.3121 - val_acc: 0.8847 - val_sparse_categorical_accuracy: 0.8847 - val_mean_squared_error: 711.4443 - val_mean_absolute_error: 22.9513
Epoch 14/30
1233/1233 [==============================] - 289s 234ms/step - loss: 0.3953 - acc: 0.8598 - sparse_categorical_accuracy: 0.8598 - mean_squared_error: 713.9806 - mean_absolute_error: 23.0251 - val_loss: 0.3011 - val_acc: 0.8904 - val_sparse_categorical_accuracy: 0.8904 - val_mean_squared_error: 711.4252 - val_mean_absolute_error: 22.9509
Epoch 15/30
1233/1233 [==============================] - 288s 233ms/step - loss: 0.3886 - acc: 0.8612 - sparse_categorical_accuracy: 0.8612 - mean_squared_error: 713.0150 - mean_absolute_error: 23.0100 - val_loss: 0.3029 - val_acc: 0.8912 - val_sparse_categorical_accuracy: 0.8912 - val_mean_squared_error: 711.4488 - val_mean_absolute_error: 22.9513
Epoch 16/30
1233/1233 [==============================] - 288s 234ms/step - loss: 0.3831 - acc: 0.8627 - sparse_categorical_accuracy: 0.8627 - mean_squared_error: 713.2172 - mean_absolute_error: 23.0095 - val_loss: 0.3066 - val_acc: 0.8866 - val_sparse_categorical_accuracy: 0.8866 - val_mean_squared_error: 711.4375 - val_mean_absolute_error: 22.9509
Epoch 17/30
1233/1233 [==============================] - 234s 190ms/step - loss: 0.3756 - acc: 0.8660 - sparse_categorical_accuracy: 0.8660 - mean_squared_error: 713.0258 - mean_absolute_error: 23.0055 - val_loss: 0.3027 - val_acc: 0.8880 - val_sparse_categorical_accuracy: 0.8880 - val_mean_squared_error: 711.4457 - val_mean_absolute_error: 22.9513
Epoch 18/30
1233/1233 [==============================] - 203s 165ms/step - loss: 0.3709 - acc: 0.8665 - sparse_categorical_accuracy: 0.8665 - mean_squared_error: 714.1227 - mean_absolute_error: 23.0322 - val_loss: 0.2979 - val_acc: 0.8900 - val_sparse_categorical_accuracy: 0.8900 - val_mean_squared_error: 711.4460 - val_mean_absolute_error: 22.9512
Epoch 19/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3704 - acc: 0.8662 - sparse_categorical_accuracy: 0.8662 - mean_squared_error: 712.7617 - mean_absolute_error: 22.9979 - val_loss: 0.2934 - val_acc: 0.8930 - val_sparse_categorical_accuracy: 0.8930 - val_mean_squared_error: 711.4456 - val_mean_absolute_error: 22.9514
Epoch 20/30
1233/1233 [==============================] - 213s 173ms/step - loss: 0.3646 - acc: 0.8687 - sparse_categorical_accuracy: 0.8687 - mean_squared_error: 713.0057 - mean_absolute_error: 23.0091 - val_loss: 0.2954 - val_acc: 0.8921 - val_sparse_categorical_accuracy: 0.8921 - val_mean_squared_error: 711.4690 - val_mean_absolute_error: 22.9518
Epoch 21/30
1233/1233 [==============================] - 215s 175ms/step - loss: 0.3645 - acc: 0.8696 - sparse_categorical_accuracy: 0.8696 - mean_squared_error: 713.2855 - mean_absolute_error: 23.0096 - val_loss: 0.2951 - val_acc: 0.8922 - val_sparse_categorical_accuracy: 0.8922 - val_mean_squared_error: 711.4720 - val_mean_absolute_error: 22.9522
Epoch 22/30
1233/1233 [==============================] - 210s 171ms/step - loss: 0.3554 - acc: 0.8710 - sparse_categorical_accuracy: 0.8710 - mean_squared_error: 713.9492 - mean_absolute_error: 23.0295 - val_loss: 0.2927 - val_acc: 0.8926 - val_sparse_categorical_accuracy: 0.8926 - val_mean_squared_error: 711.4583 - val_mean_absolute_error: 22.9517
Epoch 23/30
1233/1233 [==============================] - 210s 170ms/step - loss: 0.3535 - acc: 0.8720 - sparse_categorical_accuracy: 0.8720 - mean_squared_error: 713.3170 - mean_absolute_error: 23.0102 - val_loss: 0.2939 - val_acc: 0.8904 - val_sparse_categorical_accuracy: 0.8904 - val_mean_squared_error: 711.4724 - val_mean_absolute_error: 22.9519
Epoch 24/30
1233/1233 [==============================] - 207s 168ms/step - loss: 0.3546 - acc: 0.8723 - sparse_categorical_accuracy: 0.8723 - mean_squared_error: 713.3650 - mean_absolute_error: 23.0178 - val_loss: 0.2863 - val_acc: 0.8938 - val_sparse_categorical_accuracy: 0.8938 - val_mean_squared_error: 711.4879 - val_mean_absolute_error: 22.9524
Epoch 25/30
1233/1233 [==============================] - 211s 171ms/step - loss: 0.3508 - acc: 0.8731 - sparse_categorical_accuracy: 0.8731 - mean_squared_error: 713.9928 - mean_absolute_error: 23.0215 - val_loss: 0.2878 - val_acc: 0.8942 - val_sparse_categorical_accuracy: 0.8942 - val_mean_squared_error: 711.4763 - val_mean_absolute_error: 22.9519
Epoch 26/30
1233/1233 [==============================] - 210s 170ms/step - loss: 0.3502 - acc: 0.8731 - sparse_categorical_accuracy: 0.8731 - mean_squared_error: 712.5856 - mean_absolute_error: 22.9996 - val_loss: 0.2860 - val_acc: 0.8945 - val_sparse_categorical_accuracy: 0.8945 - val_mean_squared_error: 711.4960 - val_mean_absolute_error: 22.9525
Epoch 27/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.3457 - acc: 0.8748 - sparse_categorical_accuracy: 0.8748 - mean_squared_error: 713.7870 - mean_absolute_error: 23.0248 - val_loss: 0.2899 - val_acc: 0.8934 - val_sparse_categorical_accuracy: 0.8934 - val_mean_squared_error: 711.4858 - val_mean_absolute_error: 22.9522
Epoch 28/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.3421 - acc: 0.8765 - sparse_categorical_accuracy: 0.8765 - mean_squared_error: 713.0214 - mean_absolute_error: 23.0070 - val_loss: 0.2892 - val_acc: 0.8943 - val_sparse_categorical_accuracy: 0.8943 - val_mean_squared_error: 711.4743 - val_mean_absolute_error: 22.9520
Epoch 29/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.3404 - acc: 0.8762 - sparse_categorical_accuracy: 0.8762 - mean_squared_error: 713.6253 - mean_absolute_error: 23.0173 - val_loss: 0.2832 - val_acc: 0.8948 - val_sparse_categorical_accuracy: 0.8948 - val_mean_squared_error: 711.4888 - val_mean_absolute_error: 22.9522
Epoch 30/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.3377 - acc: 0.8765 - sparse_categorical_accuracy: 0.8765 - mean_squared_error: 712.5529 - mean_absolute_error: 22.9958 - val_loss: 0.2828 - val_acc: 0.8954 - val_sparse_categorical_accuracy: 0.8954 - val_mean_squared_error: 711.4978 - val_mean_absolute_error: 22.9524
CNN 1: Epochs=30, Train accuracy=0.87655, Validation accuracy=0.89545
Epoch 1/30
2019-10-09 23:22:39.328595: I tensorflow/core/profiler/lib/profiler_session.cc:184] Profiler session started.
1233/1233 [==============================] - 198s 161ms/step - loss: 2.0509 - acc: 0.4634 - sparse_categorical_accuracy: 0.4634 - mean_squared_error: 703.3389 - mean_absolute_error: 22.8006 - val_loss: 0.4898 - val_acc: 0.8292 - val_sparse_categorical_accuracy: 0.8292 - val_mean_squared_error: 713.5080 - val_mean_absolute_error: 23.0025
Epoch 2/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.7175 - acc: 0.7647 - sparse_categorical_accuracy: 0.7647 - mean_squared_error: 711.9302 - mean_absolute_error: 22.9815 - val_loss: 0.3950 - val_acc: 0.8562 - val_sparse_categorical_accuracy: 0.8562 - val_mean_squared_error: 713.6981 - val_mean_absolute_error: 23.0071
Epoch 3/30
1233/1233 [==============================] - 198s 160ms/step - loss: 0.5933 - acc: 0.7987 - sparse_categorical_accuracy: 0.7987 - mean_squared_error: 712.4274 - mean_absolute_error: 22.9890 - val_loss: 0.3835 - val_acc: 0.8663 - val_sparse_categorical_accuracy: 0.8663 - val_mean_squared_error: 713.7596 - val_mean_absolute_error: 23.0082
Epoch 4/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.5402 - acc: 0.8163 - sparse_categorical_accuracy: 0.8163 - mean_squared_error: 712.0808 - mean_absolute_error: 22.9841 - val_loss: 0.3485 - val_acc: 0.8762 - val_sparse_categorical_accuracy: 0.8762 - val_mean_squared_error: 713.8334 - val_mean_absolute_error: 23.0098
Epoch 5/30
1233/1233 [==============================] - 208s 169ms/step - loss: 0.5038 - acc: 0.8267 - sparse_categorical_accuracy: 0.8267 - mean_squared_error: 712.2241 - mean_absolute_error: 22.9854 - val_loss: 0.3343 - val_acc: 0.8796 - val_sparse_categorical_accuracy: 0.8796 - val_mean_squared_error: 713.8376 - val_mean_absolute_error: 23.0101
Epoch 6/30
1233/1233 [==============================] - 206s 167ms/step - loss: 0.4792 - acc: 0.8348 - sparse_categorical_accuracy: 0.8348 - mean_squared_error: 712.0892 - mean_absolute_error: 22.9838 - val_loss: 0.3298 - val_acc: 0.8780 - val_sparse_categorical_accuracy: 0.8780 - val_mean_squared_error: 713.8721 - val_mean_absolute_error: 23.0104
Epoch 7/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.4572 - acc: 0.8409 - sparse_categorical_accuracy: 0.8409 - mean_squared_error: 712.3744 - mean_absolute_error: 22.9907 - val_loss: 0.3252 - val_acc: 0.8809 - val_sparse_categorical_accuracy: 0.8809 - val_mean_squared_error: 713.8832 - val_mean_absolute_error: 23.0109
Epoch 8/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.4472 - acc: 0.8435 - sparse_categorical_accuracy: 0.8435 - mean_squared_error: 712.0691 - mean_absolute_error: 22.9809 - val_loss: 0.3128 - val_acc: 0.8837 - val_sparse_categorical_accuracy: 0.8837 - val_mean_squared_error: 713.9319 - val_mean_absolute_error: 23.0121
Epoch 9/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.4332 - acc: 0.8490 - sparse_categorical_accuracy: 0.8490 - mean_squared_error: 712.1888 - mean_absolute_error: 22.9878 - val_loss: 0.3206 - val_acc: 0.8846 - val_sparse_categorical_accuracy: 0.8846 - val_mean_squared_error: 713.9435 - val_mean_absolute_error: 23.0120
Epoch 10/30
1233/1233 [==============================] - 206s 167ms/step - loss: 0.4225 - acc: 0.8528 - sparse_categorical_accuracy: 0.8528 - mean_squared_error: 712.4367 - mean_absolute_error: 22.9887 - val_loss: 0.3185 - val_acc: 0.8831 - val_sparse_categorical_accuracy: 0.8831 - val_mean_squared_error: 713.9864 - val_mean_absolute_error: 23.0126
Epoch 11/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.4134 - acc: 0.8556 - sparse_categorical_accuracy: 0.8556 - mean_squared_error: 712.3159 - mean_absolute_error: 22.9885 - val_loss: 0.3031 - val_acc: 0.8900 - val_sparse_categorical_accuracy: 0.8900 - val_mean_squared_error: 713.9666 - val_mean_absolute_error: 23.0124
Epoch 12/30
1233/1233 [==============================] - 211s 171ms/step - loss: 0.4036 - acc: 0.8569 - sparse_categorical_accuracy: 0.8569 - mean_squared_error: 711.9561 - mean_absolute_error: 22.9810 - val_loss: 0.3010 - val_acc: 0.8889 - val_sparse_categorical_accuracy: 0.8889 - val_mean_squared_error: 713.9827 - val_mean_absolute_error: 23.0127
Epoch 13/30
1233/1233 [==============================] - 210s 171ms/step - loss: 0.4008 - acc: 0.8591 - sparse_categorical_accuracy: 0.8591 - mean_squared_error: 711.8322 - mean_absolute_error: 22.9779 - val_loss: 0.3146 - val_acc: 0.8850 - val_sparse_categorical_accuracy: 0.8850 - val_mean_squared_error: 714.0300 - val_mean_absolute_error: 23.0141
Epoch 14/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3895 - acc: 0.8617 - sparse_categorical_accuracy: 0.8617 - mean_squared_error: 712.5162 - mean_absolute_error: 22.9915 - val_loss: 0.2892 - val_acc: 0.8933 - val_sparse_categorical_accuracy: 0.8933 - val_mean_squared_error: 713.9722 - val_mean_absolute_error: 23.0128
Epoch 15/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3858 - acc: 0.8620 - sparse_categorical_accuracy: 0.8620 - mean_squared_error: 712.7015 - mean_absolute_error: 22.9963 - val_loss: 0.2930 - val_acc: 0.8933 - val_sparse_categorical_accuracy: 0.8933 - val_mean_squared_error: 713.9929 - val_mean_absolute_error: 23.0134
Epoch 16/30
1233/1233 [==============================] - 207s 168ms/step - loss: 0.3821 - acc: 0.8632 - sparse_categorical_accuracy: 0.8632 - mean_squared_error: 711.8348 - mean_absolute_error: 22.9795 - val_loss: 0.2913 - val_acc: 0.8928 - val_sparse_categorical_accuracy: 0.8928 - val_mean_squared_error: 714.0286 - val_mean_absolute_error: 23.0141
Epoch 17/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3745 - acc: 0.8664 - sparse_categorical_accuracy: 0.8664 - mean_squared_error: 712.8494 - mean_absolute_error: 22.9989 - val_loss: 0.2950 - val_acc: 0.8907 - val_sparse_categorical_accuracy: 0.8907 - val_mean_squared_error: 714.0148 - val_mean_absolute_error: 23.0137
Epoch 18/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3738 - acc: 0.8673 - sparse_categorical_accuracy: 0.8673 - mean_squared_error: 711.7711 - mean_absolute_error: 22.9783 - val_loss: 0.2896 - val_acc: 0.8942 - val_sparse_categorical_accuracy: 0.8942 - val_mean_squared_error: 714.0270 - val_mean_absolute_error: 23.0139
Epoch 19/30
1233/1233 [==============================] - 198s 160ms/step - loss: 0.3689 - acc: 0.8675 - sparse_categorical_accuracy: 0.8675 - mean_squared_error: 712.3989 - mean_absolute_error: 22.9894 - val_loss: 0.2938 - val_acc: 0.8907 - val_sparse_categorical_accuracy: 0.8907 - val_mean_squared_error: 713.9938 - val_mean_absolute_error: 23.0130
Epoch 20/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3652 - acc: 0.8700 - sparse_categorical_accuracy: 0.8700 - mean_squared_error: 712.6838 - mean_absolute_error: 22.9969 - val_loss: 0.2857 - val_acc: 0.8940 - val_sparse_categorical_accuracy: 0.8940 - val_mean_squared_error: 714.0262 - val_mean_absolute_error: 23.0136
Epoch 21/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3608 - acc: 0.8712 - sparse_categorical_accuracy: 0.8712 - mean_squared_error: 711.5900 - mean_absolute_error: 22.9715 - val_loss: 0.2835 - val_acc: 0.8964 - val_sparse_categorical_accuracy: 0.8964 - val_mean_squared_error: 714.0409 - val_mean_absolute_error: 23.0142
Epoch 22/30
1233/1233 [==============================] - 206s 167ms/step - loss: 0.3561 - acc: 0.8722 - sparse_categorical_accuracy: 0.8722 - mean_squared_error: 712.1036 - mean_absolute_error: 22.9862 - val_loss: 0.2826 - val_acc: 0.8958 - val_sparse_categorical_accuracy: 0.8958 - val_mean_squared_error: 714.0349 - val_mean_absolute_error: 23.0141
Epoch 23/30
1233/1233 [==============================] - 209s 170ms/step - loss: 0.3517 - acc: 0.8735 - sparse_categorical_accuracy: 0.8735 - mean_squared_error: 712.3892 - mean_absolute_error: 22.9861 - val_loss: 0.2816 - val_acc: 0.8931 - val_sparse_categorical_accuracy: 0.8931 - val_mean_squared_error: 714.0533 - val_mean_absolute_error: 23.0144
Epoch 24/30
1233/1233 [==============================] - 209s 169ms/step - loss: 0.3521 - acc: 0.8728 - sparse_categorical_accuracy: 0.8728 - mean_squared_error: 712.5211 - mean_absolute_error: 22.9948 - val_loss: 0.2839 - val_acc: 0.8938 - val_sparse_categorical_accuracy: 0.8938 - val_mean_squared_error: 714.0414 - val_mean_absolute_error: 23.0140
Epoch 25/30
1233/1233 [==============================] - 199s 162ms/step - loss: 0.3487 - acc: 0.8747 - sparse_categorical_accuracy: 0.8747 - mean_squared_error: 712.5450 - mean_absolute_error: 22.9929 - val_loss: 0.2829 - val_acc: 0.8952 - val_sparse_categorical_accuracy: 0.8952 - val_mean_squared_error: 714.0631 - val_mean_absolute_error: 23.0146
Epoch 26/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3463 - acc: 0.8748 - sparse_categorical_accuracy: 0.8748 - mean_squared_error: 711.8101 - mean_absolute_error: 22.9788 - val_loss: 0.2930 - val_acc: 0.8912 - val_sparse_categorical_accuracy: 0.8912 - val_mean_squared_error: 714.0426 - val_mean_absolute_error: 23.0142
Epoch 27/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3419 - acc: 0.8761 - sparse_categorical_accuracy: 0.8761 - mean_squared_error: 712.2556 - mean_absolute_error: 22.9864 - val_loss: 0.2845 - val_acc: 0.8934 - val_sparse_categorical_accuracy: 0.8934 - val_mean_squared_error: 714.0558 - val_mean_absolute_error: 23.0145
Epoch 28/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3383 - acc: 0.8775 - sparse_categorical_accuracy: 0.8775 - mean_squared_error: 712.7822 - mean_absolute_error: 22.9982 - val_loss: 0.2790 - val_acc: 0.8961 - val_sparse_categorical_accuracy: 0.8961 - val_mean_squared_error: 714.0516 - val_mean_absolute_error: 23.0144
Epoch 29/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3393 - acc: 0.8787 - sparse_categorical_accuracy: 0.8787 - mean_squared_error: 711.6257 - mean_absolute_error: 22.9730 - val_loss: 0.2801 - val_acc: 0.8943 - val_sparse_categorical_accuracy: 0.8943 - val_mean_squared_error: 714.0599 - val_mean_absolute_error: 23.0146
Epoch 30/30
1233/1233 [==============================] - 197s 160ms/step - loss: 0.3394 - acc: 0.8787 - sparse_categorical_accuracy: 0.8787 - mean_squared_error: 712.3679 - mean_absolute_error: 22.9894 - val_loss: 0.2834 - val_acc: 0.8944 - val_sparse_categorical_accuracy: 0.8944 - val_mean_squared_error: 714.0682 - val_mean_absolute_error: 23.0148
CNN 2: Epochs=30, Train accuracy=0.87868, Validation accuracy=0.89637
18800/18800 [==============================] - 11s 601us/sample - loss: 0.2887 - acc: 0.8953 - sparse_categorical_accuracy: 0.8953 - mean_squared_error: 712.8363 - mean_absolute_error: 22.9960
18800/18800 [==============================] - 11s 591us/sample - loss: 0.2930 - acc: 0.8911 - sparse_categorical_accuracy: 0.8911 - mean_squared_error: 712.8580 - mean_absolute_error: 22.9966