Name: 5-conv-128-nodes-3-dense1570617447
Model 1 :
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 26, 26, 32)        320       
_________________________________________________________________
batch_normalization (BatchNo (None, 26, 26, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 32)        9248      
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 12, 12, 32)        25632     
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 12, 32)        128       
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 10, 10, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 10, 10, 64)        256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 64)          102464    
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 64)          256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 1, 1, 128)         131200    
_________________________________________________________________
batch_normalization_6 (Batch (None, 1, 1, 128)         512       
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 47)                6063      
=================================================================
Total params: 332,015
Trainable params: 331,183
Non-trainable params: 832
_________________________________________________________________
Name: 5-conv-128-nodes-3-dense1570617448
Model 2 :
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 26, 26, 32)        320       
_________________________________________________________________
batch_normalization_7 (Batch (None, 26, 26, 32)        128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 24, 24, 32)        9248      
_________________________________________________________________
batch_normalization_8 (Batch (None, 24, 24, 32)        128       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 12, 12, 32)        25632     
_________________________________________________________________
batch_normalization_9 (Batch (None, 12, 12, 32)        128       
_________________________________________________________________
dropout_3 (Dropout)          (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 10, 10, 64)        18496     
_________________________________________________________________
batch_normalization_10 (Batc (None, 10, 10, 64)        256       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 4, 4, 64)          102464    
_________________________________________________________________
batch_normalization_12 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 1, 1, 128)         131200    
_________________________________________________________________
batch_normalization_13 (Batc (None, 1, 1, 128)         512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 47)                6063      
=================================================================
Total params: 332,015
Trainable params: 331,183
Non-trainable params: 832
_________________________________________________________________
2019-10-09 16:07:30.511959: I tensorflow/core/platform/cpu_feature_guard.cc:142] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
2019-10-09 16:07:30.535395: I tensorflow/core/platform/profile_utils/cpu_utils.cc:94] CPU Frequency: 2601325000 Hz
2019-10-09 16:07:30.535916: I tensorflow/compiler/xla/service/service.cc:168] XLA service 0x55a9edf09090 executing computations on platform Host. Devices:
2019-10-09 16:07:30.535952: I tensorflow/compiler/xla/service/service.cc:175]   StreamExecutor device (0): Host, Default Version
Epoch 1/30
W1009 16:07:33.033088 139657519474304 deprecation.py:323] From /usr/lib/python3.7/site-packages/tensorflow_core/python/keras/optimizer_v2/optimizer_v2.py:468: BaseResourceVariable.constraint (from tensorflow.python.ops.resource_variable_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Apply a constraint manually following the optimizer update step.
2019-10-09 16:07:34.389883: I tensorflow/core/profiler/lib/profiler_session.cc:184] Profiler session started.
1586/1586 [==============================] - 307s 193ms/step - loss: 1.3247 - acc: 0.6151 - sparse_categorical_accuracy: 0.6151 - mean_squared_error: 711.1321 - mean_absolute_error: 22.9593 - val_loss: 0.4435 - val_acc: 0.8435 - val_sparse_categorical_accuracy: 0.8435 - val_mean_squared_error: 720.1542 - val_mean_absolute_error: 23.1656
Epoch 2/30
1586/1586 [==============================] - 252s 159ms/step - loss: 0.6424 - acc: 0.7843 - sparse_categorical_accuracy: 0.7843 - mean_squared_error: 711.1089 - mean_absolute_error: 22.9586 - val_loss: 0.3910 - val_acc: 0.8599 - val_sparse_categorical_accuracy: 0.8599 - val_mean_squared_error: 720.1547 - val_mean_absolute_error: 23.1656
Epoch 3/30
1586/1586 [==============================] - 250s 158ms/step - loss: 0.5552 - acc: 0.8103 - sparse_categorical_accuracy: 0.8103 - mean_squared_error: 711.1503 - mean_absolute_error: 22.9589 - val_loss: 0.3640 - val_acc: 0.8669 - val_sparse_categorical_accuracy: 0.8669 - val_mean_squared_error: 720.1548 - val_mean_absolute_error: 23.1656
Epoch 4/30
1586/1586 [==============================] - 252s 159ms/step - loss: 0.5131 - acc: 0.8234 - sparse_categorical_accuracy: 0.8234 - mean_squared_error: 710.8385 - mean_absolute_error: 22.9525 - val_loss: 0.3345 - val_acc: 0.8773 - val_sparse_categorical_accuracy: 0.8773 - val_mean_squared_error: 720.1550 - val_mean_absolute_error: 23.1656
Epoch 5/30
1586/1586 [==============================] - 250s 158ms/step - loss: 0.4784 - acc: 0.8333 - sparse_categorical_accuracy: 0.8333 - mean_squared_error: 711.3217 - mean_absolute_error: 22.9622 - val_loss: 0.3403 - val_acc: 0.8750 - val_sparse_categorical_accuracy: 0.8750 - val_mean_squared_error: 720.1552 - val_mean_absolute_error: 23.1656
Epoch 6/30
1586/1586 [==============================] - 255s 161ms/step - loss: 0.4600 - acc: 0.8399 - sparse_categorical_accuracy: 0.8399 - mean_squared_error: 711.1157 - mean_absolute_error: 22.9585 - val_loss: 0.3284 - val_acc: 0.8754 - val_sparse_categorical_accuracy: 0.8754 - val_mean_squared_error: 720.1552 - val_mean_absolute_error: 23.1656
Epoch 7/30
1586/1586 [==============================] - 254s 160ms/step - loss: 0.4452 - acc: 0.8445 - sparse_categorical_accuracy: 0.8445 - mean_squared_error: 711.0919 - mean_absolute_error: 22.9593 - val_loss: 0.3216 - val_acc: 0.8788 - val_sparse_categorical_accuracy: 0.8788 - val_mean_squared_error: 720.1552 - val_mean_absolute_error: 23.1656
Epoch 8/30
1586/1586 [==============================] - 254s 160ms/step - loss: 0.4270 - acc: 0.8507 - sparse_categorical_accuracy: 0.8507 - mean_squared_error: 711.0840 - mean_absolute_error: 22.9573 - val_loss: 0.3144 - val_acc: 0.8827 - val_sparse_categorical_accuracy: 0.8827 - val_mean_squared_error: 720.1552 - val_mean_absolute_error: 23.1656
Epoch 9/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.4168 - acc: 0.8523 - sparse_categorical_accuracy: 0.8523 - mean_squared_error: 711.3649 - mean_absolute_error: 22.9639 - val_loss: 0.3065 - val_acc: 0.8867 - val_sparse_categorical_accuracy: 0.8867 - val_mean_squared_error: 720.1554 - val_mean_absolute_error: 23.1656
Epoch 10/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.4090 - acc: 0.8549 - sparse_categorical_accuracy: 0.8549 - mean_squared_error: 710.9801 - mean_absolute_error: 22.9560 - val_loss: 0.2960 - val_acc: 0.8872 - val_sparse_categorical_accuracy: 0.8872 - val_mean_squared_error: 720.1553 - val_mean_absolute_error: 23.1656
Epoch 11/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.3987 - acc: 0.8589 - sparse_categorical_accuracy: 0.8589 - mean_squared_error: 711.0478 - mean_absolute_error: 22.9577 - val_loss: 0.2926 - val_acc: 0.8891 - val_sparse_categorical_accuracy: 0.8891 - val_mean_squared_error: 720.1554 - val_mean_absolute_error: 23.1656
Epoch 12/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.3907 - acc: 0.8614 - sparse_categorical_accuracy: 0.8614 - mean_squared_error: 711.0073 - mean_absolute_error: 22.9547 - val_loss: 0.2967 - val_acc: 0.8863 - val_sparse_categorical_accuracy: 0.8863 - val_mean_squared_error: 720.1555 - val_mean_absolute_error: 23.1656
Epoch 13/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3833 - acc: 0.8640 - sparse_categorical_accuracy: 0.8640 - mean_squared_error: 711.1947 - mean_absolute_error: 22.9612 - val_loss: 0.3058 - val_acc: 0.8844 - val_sparse_categorical_accuracy: 0.8844 - val_mean_squared_error: 720.1554 - val_mean_absolute_error: 23.1656
Epoch 14/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3752 - acc: 0.8657 - sparse_categorical_accuracy: 0.8657 - mean_squared_error: 711.1240 - mean_absolute_error: 22.9579 - val_loss: 0.2876 - val_acc: 0.8940 - val_sparse_categorical_accuracy: 0.8940 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 15/30
1586/1586 [==============================] - 240s 151ms/step - loss: 0.3712 - acc: 0.8664 - sparse_categorical_accuracy: 0.8664 - mean_squared_error: 711.3481 - mean_absolute_error: 22.9656 - val_loss: 0.2846 - val_acc: 0.8942 - val_sparse_categorical_accuracy: 0.8942 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 16/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3683 - acc: 0.8685 - sparse_categorical_accuracy: 0.8685 - mean_squared_error: 711.2795 - mean_absolute_error: 22.9589 - val_loss: 0.2930 - val_acc: 0.8895 - val_sparse_categorical_accuracy: 0.8895 - val_mean_squared_error: 720.1555 - val_mean_absolute_error: 23.1656
Epoch 17/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3624 - acc: 0.8685 - sparse_categorical_accuracy: 0.8685 - mean_squared_error: 710.9781 - mean_absolute_error: 22.9567 - val_loss: 0.2814 - val_acc: 0.8957 - val_sparse_categorical_accuracy: 0.8957 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 18/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3592 - acc: 0.8702 - sparse_categorical_accuracy: 0.8702 - mean_squared_error: 711.5078 - mean_absolute_error: 22.9678 - val_loss: 0.2788 - val_acc: 0.8928 - val_sparse_categorical_accuracy: 0.8928 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 19/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3588 - acc: 0.8706 - sparse_categorical_accuracy: 0.8706 - mean_squared_error: 710.8967 - mean_absolute_error: 22.9524 - val_loss: 0.2749 - val_acc: 0.8983 - val_sparse_categorical_accuracy: 0.8983 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 20/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3541 - acc: 0.8726 - sparse_categorical_accuracy: 0.8726 - mean_squared_error: 711.4341 - mean_absolute_error: 22.9639 - val_loss: 0.2764 - val_acc: 0.8959 - val_sparse_categorical_accuracy: 0.8959 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 21/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3496 - acc: 0.8736 - sparse_categorical_accuracy: 0.8736 - mean_squared_error: 710.2863 - mean_absolute_error: 22.9418 - val_loss: 0.2891 - val_acc: 0.8898 - val_sparse_categorical_accuracy: 0.8898 - val_mean_squared_error: 720.1555 - val_mean_absolute_error: 23.1656
Epoch 22/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3478 - acc: 0.8733 - sparse_categorical_accuracy: 0.8733 - mean_squared_error: 711.7770 - mean_absolute_error: 22.9723 - val_loss: 0.2752 - val_acc: 0.8965 - val_sparse_categorical_accuracy: 0.8965 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 23/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3444 - acc: 0.8759 - sparse_categorical_accuracy: 0.8759 - mean_squared_error: 710.5651 - mean_absolute_error: 22.9504 - val_loss: 0.2848 - val_acc: 0.8908 - val_sparse_categorical_accuracy: 0.8908 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 24/30
1586/1586 [==============================] - 240s 151ms/step - loss: 0.3415 - acc: 0.8761 - sparse_categorical_accuracy: 0.8761 - mean_squared_error: 711.7104 - mean_absolute_error: 22.9697 - val_loss: 0.2729 - val_acc: 0.8987 - val_sparse_categorical_accuracy: 0.8987 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 25/30
1586/1586 [==============================] - 254s 160ms/step - loss: 0.3393 - acc: 0.8769 - sparse_categorical_accuracy: 0.8769 - mean_squared_error: 710.7593 - mean_absolute_error: 22.9499 - val_loss: 0.2749 - val_acc: 0.8970 - val_sparse_categorical_accuracy: 0.8970 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 26/30
1586/1586 [==============================] - 255s 161ms/step - loss: 0.3337 - acc: 0.8791 - sparse_categorical_accuracy: 0.8791 - mean_squared_error: 711.8749 - mean_absolute_error: 22.9747 - val_loss: 0.2896 - val_acc: 0.8907 - val_sparse_categorical_accuracy: 0.8907 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 27/30
1586/1586 [==============================] - 241s 152ms/step - loss: 0.3376 - acc: 0.8771 - sparse_categorical_accuracy: 0.8771 - mean_squared_error: 710.4604 - mean_absolute_error: 22.9425 - val_loss: 0.2772 - val_acc: 0.8936 - val_sparse_categorical_accuracy: 0.8936 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 28/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3322 - acc: 0.8787 - sparse_categorical_accuracy: 0.8787 - mean_squared_error: 711.4484 - mean_absolute_error: 22.9678 - val_loss: 0.2758 - val_acc: 0.8934 - val_sparse_categorical_accuracy: 0.8934 - val_mean_squared_error: 720.1556 - val_mean_absolute_error: 23.1656
Epoch 29/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3297 - acc: 0.8790 - sparse_categorical_accuracy: 0.8790 - mean_squared_error: 711.1658 - mean_absolute_error: 22.9587 - val_loss: 0.2701 - val_acc: 0.8965 - val_sparse_categorical_accuracy: 0.8965 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
Epoch 30/30
1586/1586 [==============================] - 239s 151ms/step - loss: 0.3267 - acc: 0.8801 - sparse_categorical_accuracy: 0.8801 - mean_squared_error: 711.1191 - mean_absolute_error: 22.9604 - val_loss: 0.2728 - val_acc: 0.8940 - val_sparse_categorical_accuracy: 0.8940 - val_mean_squared_error: 720.1557 - val_mean_absolute_error: 23.1656
CNN 1: Epochs=30, Train accuracy=0.88011, Validation accuracy=0.89867
Epoch 1/30
2019-10-09 18:10:01.833797: I tensorflow/core/profiler/lib/profiler_session.cc:184] Profiler session started.
1586/1586 [==============================] - 239s 151ms/step - loss: 1.2783 - acc: 0.6248 - sparse_categorical_accuracy: 0.6248 - mean_squared_error: 712.0144 - mean_absolute_error: 22.9878 - val_loss: 0.4659 - val_acc: 0.8342 - val_sparse_categorical_accuracy: 0.8342 - val_mean_squared_error: 712.2484 - val_mean_absolute_error: 22.9065
Epoch 2/30
1586/1586 [==============================] - 237s 149ms/step - loss: 0.6407 - acc: 0.7845 - sparse_categorical_accuracy: 0.7845 - mean_squared_error: 711.8808 - mean_absolute_error: 22.9853 - val_loss: 0.3873 - val_acc: 0.8595 - val_sparse_categorical_accuracy: 0.8595 - val_mean_squared_error: 712.2488 - val_mean_absolute_error: 22.9065
Epoch 3/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.5530 - acc: 0.8114 - sparse_categorical_accuracy: 0.8114 - mean_squared_error: 712.0936 - mean_absolute_error: 22.9900 - val_loss: 0.3689 - val_acc: 0.8698 - val_sparse_categorical_accuracy: 0.8698 - val_mean_squared_error: 712.2490 - val_mean_absolute_error: 22.9065
Epoch 4/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.5076 - acc: 0.8242 - sparse_categorical_accuracy: 0.8242 - mean_squared_error: 711.9708 - mean_absolute_error: 22.9852 - val_loss: 0.3459 - val_acc: 0.8691 - val_sparse_categorical_accuracy: 0.8691 - val_mean_squared_error: 712.2493 - val_mean_absolute_error: 22.9065
Epoch 5/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.4785 - acc: 0.8346 - sparse_categorical_accuracy: 0.8346 - mean_squared_error: 712.1354 - mean_absolute_error: 22.9910 - val_loss: 0.3392 - val_acc: 0.8746 - val_sparse_categorical_accuracy: 0.8746 - val_mean_squared_error: 712.2496 - val_mean_absolute_error: 22.9065
Epoch 6/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.4552 - acc: 0.8407 - sparse_categorical_accuracy: 0.8407 - mean_squared_error: 711.8682 - mean_absolute_error: 22.9848 - val_loss: 0.3350 - val_acc: 0.8759 - val_sparse_categorical_accuracy: 0.8759 - val_mean_squared_error: 712.2496 - val_mean_absolute_error: 22.9065
Epoch 7/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.4394 - acc: 0.8450 - sparse_categorical_accuracy: 0.8450 - mean_squared_error: 712.1889 - mean_absolute_error: 22.9915 - val_loss: 0.3108 - val_acc: 0.8845 - val_sparse_categorical_accuracy: 0.8845 - val_mean_squared_error: 712.2495 - val_mean_absolute_error: 22.9065
Epoch 8/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.4317 - acc: 0.8484 - sparse_categorical_accuracy: 0.8484 - mean_squared_error: 712.1348 - mean_absolute_error: 22.9893 - val_loss: 0.3089 - val_acc: 0.8815 - val_sparse_categorical_accuracy: 0.8815 - val_mean_squared_error: 712.2497 - val_mean_absolute_error: 22.9065
Epoch 9/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.4165 - acc: 0.8526 - sparse_categorical_accuracy: 0.8526 - mean_squared_error: 711.7632 - mean_absolute_error: 22.9832 - val_loss: 0.2949 - val_acc: 0.8888 - val_sparse_categorical_accuracy: 0.8888 - val_mean_squared_error: 712.2498 - val_mean_absolute_error: 22.9065
Epoch 10/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.4072 - acc: 0.8555 - sparse_categorical_accuracy: 0.8555 - mean_squared_error: 711.9422 - mean_absolute_error: 22.9855 - val_loss: 0.3171 - val_acc: 0.8831 - val_sparse_categorical_accuracy: 0.8831 - val_mean_squared_error: 712.2498 - val_mean_absolute_error: 22.9065
Epoch 11/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.3983 - acc: 0.8590 - sparse_categorical_accuracy: 0.8590 - mean_squared_error: 712.1069 - mean_absolute_error: 22.9892 - val_loss: 0.3068 - val_acc: 0.8844 - val_sparse_categorical_accuracy: 0.8844 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 12/30
1586/1586 [==============================] - 237s 150ms/step - loss: 0.3888 - acc: 0.8625 - sparse_categorical_accuracy: 0.8625 - mean_squared_error: 711.9464 - mean_absolute_error: 22.9864 - val_loss: 0.2852 - val_acc: 0.8920 - val_sparse_categorical_accuracy: 0.8920 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 13/30
1586/1586 [==============================] - 238s 150ms/step - loss: 0.3869 - acc: 0.8613 - sparse_categorical_accuracy: 0.8613 - mean_squared_error: 712.1396 - mean_absolute_error: 22.9909 - val_loss: 0.2802 - val_acc: 0.8932 - val_sparse_categorical_accuracy: 0.8932 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 14/30
1586/1586 [==============================] - 251s 158ms/step - loss: 0.3798 - acc: 0.8640 - sparse_categorical_accuracy: 0.8640 - mean_squared_error: 712.3041 - mean_absolute_error: 22.9949 - val_loss: 0.2799 - val_acc: 0.8920 - val_sparse_categorical_accuracy: 0.8920 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 15/30
1586/1586 [==============================] - 253s 159ms/step - loss: 0.3738 - acc: 0.8650 - sparse_categorical_accuracy: 0.8650 - mean_squared_error: 711.7110 - mean_absolute_error: 22.9820 - val_loss: 0.2926 - val_acc: 0.8864 - val_sparse_categorical_accuracy: 0.8864 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 16/30
1586/1586 [==============================] - 241s 152ms/step - loss: 0.3692 - acc: 0.8680 - sparse_categorical_accuracy: 0.8680 - mean_squared_error: 712.1721 - mean_absolute_error: 22.9903 - val_loss: 0.2854 - val_acc: 0.8874 - val_sparse_categorical_accuracy: 0.8874 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 17/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3665 - acc: 0.8681 - sparse_categorical_accuracy: 0.8681 - mean_squared_error: 711.8267 - mean_absolute_error: 22.9838 - val_loss: 0.2842 - val_acc: 0.8895 - val_sparse_categorical_accuracy: 0.8895 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 18/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3641 - acc: 0.8697 - sparse_categorical_accuracy: 0.8697 - mean_squared_error: 712.2340 - mean_absolute_error: 22.9890 - val_loss: 0.2775 - val_acc: 0.8964 - val_sparse_categorical_accuracy: 0.8964 - val_mean_squared_error: 712.2499 - val_mean_absolute_error: 22.9065
Epoch 19/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3559 - acc: 0.8726 - sparse_categorical_accuracy: 0.8726 - mean_squared_error: 711.8293 - mean_absolute_error: 22.9871 - val_loss: 0.2783 - val_acc: 0.8949 - val_sparse_categorical_accuracy: 0.8949 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 20/30
1586/1586 [==============================] - 235s 148ms/step - loss: 0.3546 - acc: 0.8723 - sparse_categorical_accuracy: 0.8723 - mean_squared_error: 711.9416 - mean_absolute_error: 22.9855 - val_loss: 0.2806 - val_acc: 0.8927 - val_sparse_categorical_accuracy: 0.8927 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 21/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3493 - acc: 0.8738 - sparse_categorical_accuracy: 0.8738 - mean_squared_error: 711.9751 - mean_absolute_error: 22.9861 - val_loss: 0.2729 - val_acc: 0.8950 - val_sparse_categorical_accuracy: 0.8950 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 22/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3457 - acc: 0.8748 - sparse_categorical_accuracy: 0.8748 - mean_squared_error: 712.2679 - mean_absolute_error: 22.9931 - val_loss: 0.2722 - val_acc: 0.8955 - val_sparse_categorical_accuracy: 0.8955 - val_mean_squared_error: 712.2502 - val_mean_absolute_error: 22.9065
Epoch 23/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3474 - acc: 0.8753 - sparse_categorical_accuracy: 0.8753 - mean_squared_error: 711.7907 - mean_absolute_error: 22.9797 - val_loss: 0.2700 - val_acc: 0.8950 - val_sparse_categorical_accuracy: 0.8950 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 24/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3420 - acc: 0.8757 - sparse_categorical_accuracy: 0.8757 - mean_squared_error: 712.0909 - mean_absolute_error: 22.9932 - val_loss: 0.2716 - val_acc: 0.8938 - val_sparse_categorical_accuracy: 0.8938 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 25/30
1586/1586 [==============================] - 236s 149ms/step - loss: 0.3404 - acc: 0.8761 - sparse_categorical_accuracy: 0.8761 - mean_squared_error: 712.0898 - mean_absolute_error: 22.9860 - val_loss: 0.2677 - val_acc: 0.8958 - val_sparse_categorical_accuracy: 0.8958 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 26/30
1586/1586 [==============================] - 245s 154ms/step - loss: 0.3374 - acc: 0.8777 - sparse_categorical_accuracy: 0.8777 - mean_squared_error: 711.9173 - mean_absolute_error: 22.9892 - val_loss: 0.2683 - val_acc: 0.8958 - val_sparse_categorical_accuracy: 0.8958 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 27/30
1586/1586 [==============================] - 251s 158ms/step - loss: 0.3380 - acc: 0.8776 - sparse_categorical_accuracy: 0.8776 - mean_squared_error: 712.0441 - mean_absolute_error: 22.9880 - val_loss: 0.2680 - val_acc: 0.8965 - val_sparse_categorical_accuracy: 0.8965 - val_mean_squared_error: 712.2502 - val_mean_absolute_error: 22.9065
Epoch 28/30
1586/1586 [==============================] - 251s 158ms/step - loss: 0.3352 - acc: 0.8789 - sparse_categorical_accuracy: 0.8789 - mean_squared_error: 712.1464 - mean_absolute_error: 22.9892 - val_loss: 0.2652 - val_acc: 0.8981 - val_sparse_categorical_accuracy: 0.8981 - val_mean_squared_error: 712.2502 - val_mean_absolute_error: 22.9065
Epoch 29/30
1586/1586 [==============================] - 246s 155ms/step - loss: 0.3323 - acc: 0.8799 - sparse_categorical_accuracy: 0.8799 - mean_squared_error: 712.1838 - mean_absolute_error: 22.9911 - val_loss: 0.2673 - val_acc: 0.8973 - val_sparse_categorical_accuracy: 0.8973 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
Epoch 30/30
1586/1586 [==============================] - 252s 159ms/step - loss: 0.3293 - acc: 0.8802 - sparse_categorical_accuracy: 0.8802 - mean_squared_error: 711.6483 - mean_absolute_error: 22.9800 - val_loss: 0.2686 - val_acc: 0.8968 - val_sparse_categorical_accuracy: 0.8968 - val_mean_squared_error: 712.2501 - val_mean_absolute_error: 22.9065
CNN 2: Epochs=30, Train accuracy=0.88021, Validation accuracy=0.89814
18800/18800 [==============================] - 13s 692us/sample - loss: 0.2802 - acc: 0.8955 - sparse_categorical_accuracy: 0.8955 - mean_squared_error: 712.0400 - mean_absolute_error: 22.9796
18800/18800 [==============================] - 13s 693us/sample - loss: 0.2836 - acc: 0.8960 - sparse_categorical_accuracy: 0.8960 - mean_squared_error: 712.0401 - mean_absolute_error: 22.9796